# DimStyleShowOpeningHt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimStyleShowOpeningHt Property
ParameterTypeId Class See Also
---
"Show Opening Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimStyleShowOpeningHt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimStyleShowOpeningHt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimStyleShowOpeningHt {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace